coocox/Mplib/Toshaba/TMPM36x/TMPM361/cmsis_lib/lib/include/tmpm361_gpio.h
#define IS_GPIO_PA_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1))

#define IS_GPIO_PB_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1))

#define IS_GPIO_PE_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                         ((param) == GPIO_FUNC_REG_2)|| \
                                         ((param) == GPIO_FUNC_REG_3))

#define IS_GPIO_PF_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1))

#define IS_GPIO_PG_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                         ((param) == GPIO_FUNC_REG_2)|| \
                                         ((param) == GPIO_FUNC_REG_3))

#define IS_GPIO_PI_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1))

#define IS_GPIO_PJ_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_2))

#define IS_GPIO_PL_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                         ((param) == GPIO_FUNC_REG_2)|| \
                                         ((param) == GPIO_FUNC_REG_3))

#define IS_GPIO_PM_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                         ((param) == GPIO_FUNC_REG_2)|| \
                                         ((param) == GPIO_FUNC_REG_3))

#define IS_GPIO_PN_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                         ((param) == GPIO_FUNC_REG_2)|| \
                                         ((param) == GPIO_FUNC_REG_3))

#define IS_GPIO_PP_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                         ((param) == GPIO_FUNC_REG_2))
/** @} */
/* End of group GPIO_Parameter_Definition */

/** @defgroup GPIO_Bit_Define
  * @{
  */
#define GPIO_BIT_VALUE_1                ((uint8_t)0x01)
#define GPIO_BIT_VALUE_0                ((uint8_t)0x00)

#define IS_GPIO_BIT_VALUE(BitValue)     (((BitValue) == GPIO_BIT_VALUE_1)|| \
                                         ((BitValue) == GPIO_BIT_VALUE_0))

#define GPIO_BIT_0                      ((uint8_t)0x01)
#define GPIO_BIT_1                      ((uint8_t)0x02)
#define GPIO_BIT_2                      ((uint8_t)0x04)
#define GPIO_BIT_3                      ((uint8_t)0x08)
#define GPIO_BIT_4                      ((uint8_t)0x10)
#define GPIO_BIT_5                      ((uint8_t)0x20)
#define GPIO_BIT_6                      ((uint8_t)0x40)
#define GPIO_BIT_7                      ((uint8_t)0x80)
#define GPIO_BIT_ALL                    ((uint8_t)0xFF)

#define GPIO_PA_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PA_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PA_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PA_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PA_FR1_BIT_ALL                      ((uint8_t)0xFF)

#define GPIO_PB_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PB_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PB_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PB_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PB_FR1_BIT_ALL                      ((uint8_t)0xFF)

#define GPIO_PE_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PE_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PE_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PE_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PE_FR1_BIT_ALL                      ((uint8_t)0x7F)
#define GPIO_PE_FR2_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PE_FR3_BIT_ALL                      ((uint8_t)0xC0)

#define GPIO_PF_OUTPUT_BIT_ALL                   ((uint8_t)0x1F)
#define GPIO_PF_PULLUP_BIT_ALL                   ((uint8_t)0x1F)
#define GPIO_PF_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x1F)
#define GPIO_PF_INPUT_BIT_ALL                    ((uint8_t)0x1F)
#define GPIO_PF_FR1_BIT_ALL                      ((uint8_t)0x1F)

#define GPIO_PG_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PG_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PG_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PG_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PG_FR1_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PG_FR2_BIT_ALL                      ((uint8_t)0x33)
#define GPIO_PG_FR3_BIT_ALL                      ((uint8_t)0xCC)

#define GPIO_PI_OUTPUT_BIT_ALL                   ((uint8_t)0x0F)
#define GPIO_PI_PULLUP_BIT_ALL                   ((uint8_t)0x01)
#define GPIO_PI_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x0D)
#define GPIO_PI_INPUT_BIT_ALL                    ((uint8_t)0x0F)
#define GPIO_PI_FR1_BIT_ALL                      ((uint8_t)0x0E)

#define GPIO_PJ_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PJ_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PJ_FR2_BIT_ALL                      ((uint8_t)0xF8)

#define GPIO_PL_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PL_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PL_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PL_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PL_FR1_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PL_FR2_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PL_FR3_BIT_ALL                      ((uint8_t)0x70)

#define GPIO_PM_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PM_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PM_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PM_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PM_FR1_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PM_FR2_BIT_ALL                      ((uint8_t)0x0F)
#define GPIO_PM_FR3_BIT_ALL                      ((uint8_t)0x11)

#define GPIO_PN_OUTPUT_BIT_ALL                   ((uint8_t)0x0F)
#define GPIO_PN_PULLUP_BIT_ALL                   ((uint8_t)0x0F)
#define GPIO_PN_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x0F)
#define GPIO_PN_INPUT_BIT_ALL                    ((uint8_t)0x0F)
#define GPIO_PN_FR1_BIT_ALL                      ((uint8_t)0x0F)
#define GPIO_PN_FR2_BIT_ALL                      ((uint8_t)0x0C)
#define GPIO_PN_FR3_BIT_ALL                      ((uint8_t)0x0C)

