coocox/Mplib/Toshaba/TMPM36x/TMPM361/cmsis_lib/lib/include/tmpm361_gpio.h
#define IS_GPIO_PB_PULLUP_BIT(param)     (((param) & GPIO_PB_PULLUP_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PB_PULLUP_BIT_ALL))))

#define IS_GPIO_PB_INPUT_BIT(param)      (((param) & GPIO_PB_INPUT_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PB_INPUT_BIT_ALL))))

#define IS_GPIO_PE_OUTPUT_BIT(param)     (((param) & GPIO_PE_OUTPUT_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PE_OUTPUT_BIT_ALL))))

#define IS_GPIO_PE_FR1_BIT(param)        (((param) & GPIO_PE_FR1_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PE_FR1_BIT_ALL))))

#define IS_GPIO_PE_FR2_BIT(param)        (((param) & GPIO_PE_FR2_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PE_FR2_BIT_ALL))))

#define IS_GPIO_PE_FR3_BIT(param)        (((param) & GPIO_PE_FR3_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PE_FR3_BIT_ALL))))

#define IS_GPIO_PE_OPEN_DRAIN_BIT(param) (((param) & GPIO_PE_OPEN_DRAIN_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PE_OPEN_DRAIN_BIT_ALL))))

#define IS_GPIO_PE_PULLUP_BIT(param)     (((param) & GPIO_PE_PULLUP_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PE_PULLUP_BIT_ALL))))

#define IS_GPIO_PE_INPUT_BIT(param)      (((param) & GPIO_PE_INPUT_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PE_INPUT_BIT_ALL))))

#define IS_GPIO_PF_OUTPUT_BIT(param)     (((param) & GPIO_PF_OUTPUT_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PF_OUTPUT_BIT_ALL))))

#define IS_GPIO_PF_FR1_BIT(param)        (((param) & GPIO_PF_FR1_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PF_FR1_BIT_ALL))))

#define IS_GPIO_PF_OPEN_DRAIN_BIT(param) (((param) & GPIO_PF_OPEN_DRAIN_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PF_OPEN_DRAIN_BIT_ALL))))

#define IS_GPIO_PF_PULLUP_BIT(param)     (((param) & GPIO_PF_PULLUP_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PF_PULLUP_BIT_ALL))))

#define IS_GPIO_PF_INPUT_BIT(param)      (((param) & GPIO_PF_INPUT_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PF_INPUT_BIT_ALL))))

#define IS_GPIO_PG_OUTPUT_BIT(param)     (((param) & GPIO_PG_OUTPUT_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PG_OUTPUT_BIT_ALL))))

#define IS_GPIO_PG_FR1_BIT(param)        (((param) & GPIO_PG_FR1_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PG_FR1_BIT_ALL))))

#define IS_GPIO_PG_FR2_BIT(param)        (((param) & GPIO_PG_FR2_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PG_FR2_BIT_ALL))))

#define IS_GPIO_PG_FR3_BIT(param)        (((param) & GPIO_PG_FR3_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PG_FR3_BIT_ALL))))

#define IS_GPIO_PG_OPEN_DRAIN_BIT(param) (((param) & GPIO_PG_OPEN_DRAIN_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PG_OPEN_DRAIN_BIT_ALL))))

#define IS_GPIO_PG_PULLUP_BIT(param)     (((param) & GPIO_PG_PULLUP_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PG_PULLUP_BIT_ALL))))

#define IS_GPIO_PG_INPUT_BIT(param)      (((param) & GPIO_PG_INPUT_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PG_INPUT_BIT_ALL))))

#define IS_GPIO_PI_OUTPUT_BIT(param)     (((param) & GPIO_PI_OUTPUT_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PI_OUTPUT_BIT_ALL))))

#define IS_GPIO_PI_FR1_BIT(param)        (((param) & GPIO_PI_FR1_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PI_FR1_BIT_ALL))))

#define IS_GPIO_PI_OPEN_DRAIN_BIT(param) (((param) & GPIO_PI_OPEN_DRAIN_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PI_OPEN_DRAIN_BIT_ALL))))

#define IS_GPIO_PI_PULLUP_BIT(param)     (((param) & GPIO_PI_PULLUP_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PI_PULLUP_BIT_ALL))))

#define IS_GPIO_PI_INPUT_BIT(param)      (((param) & GPIO_PI_INPUT_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PI_INPUT_BIT_ALL))))

#define IS_GPIO_PJ_FR2_BIT(param)        (((param) & GPIO_PJ_FR2_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PJ_FR2_BIT_ALL))))

#define IS_GPIO_PJ_PULLUP_BIT(param)     (((param) & GPIO_PJ_PULLUP_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PJ_PULLUP_BIT_ALL))))

#define IS_GPIO_PJ_INPUT_BIT(param)      (((param) & GPIO_PJ_INPUT_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PJ_INPUT_BIT_ALL))))

#define IS_GPIO_PL_OUTPUT_BIT(param)     (((param) & GPIO_PL_OUTPUT_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PL_OUTPUT_BIT_ALL))))

#define IS_GPIO_PL_FR1_BIT(param)        (((param) & GPIO_PL_FR1_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PL_FR1_BIT_ALL))))

#define IS_GPIO_PL_FR2_BIT(param)        (((param) & GPIO_PL_FR2_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PL_FR2_BIT_ALL))))

#define IS_GPIO_PL_FR3_BIT(param)        (((param) & GPIO_PL_FR3_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PL_FR3_BIT_ALL))))

#define IS_GPIO_PL_OPEN_DRAIN_BIT(param) (((param) & GPIO_PL_OPEN_DRAIN_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PL_OPEN_DRAIN_BIT_ALL))))

#define IS_GPIO_PL_PULLUP_BIT(param)     (((param) & GPIO_PL_PULLUP_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PL_PULLUP_BIT_ALL))))

#define IS_GPIO_PL_INPUT_BIT(param)      (((param) & GPIO_PL_INPUT_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PL_INPUT_BIT_ALL))))

#define IS_GPIO_PM_OUTPUT_BIT(param)     (((param) & GPIO_PM_OUTPUT_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PM_OUTPUT_BIT_ALL))))

#define IS_GPIO_PM_FR1_BIT(param)        (((param) & GPIO_PM_FR1_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PM_FR1_BIT_ALL))))

#define IS_GPIO_PM_FR2_BIT(param)        (((param) & GPIO_PM_FR2_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PM_FR2_BIT_ALL))))

#define IS_GPIO_PM_FR3_BIT(param)        (((param) & GPIO_PM_FR3_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PM_FR3_BIT_ALL))))

#define IS_GPIO_PM_OPEN_DRAIN_BIT(param) (((param) & GPIO_PM_OPEN_DRAIN_BIT_ALL)&& \
                                          (!((param) & (~GPIO_PM_OPEN_DRAIN_BIT_ALL))))

